In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\user\\Documents\\data sets\\ecommerce_data.csv",usecols = ['date'])
df1 = pd.read_csv("C:\\Users\\user\\Documents\\data sets\\click.csv",usecols=['Timestamp'])

In [3]:
df.head()

         date
0  2019-12-16
1  2019-12-16
2  2019-12-16
3  2019-12-16
4  2019-12-16

In [4]:
df1.head()

             Timestamp
0  2016-06-09 21:43:05
1  2016-01-16 17:56:05
2  2016-06-29 10:50:45
3  2016-06-21 14:32:32
4  2016-07-21 10:54:35

In [5]:
print(df.info())
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523684 entries, 0 to 523683
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    523684 non-null  object
dtypes: object(1)
memory usage: 4.0+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  10000 non-null  object
dtypes: object(1)
memory usage: 78.2+ KB

# Working with Dates

In [6]:
df['date'] = pd.to_datetime(df['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523684 entries, 0 to 523683
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    523684 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 4.0 MB

# 1.Year

In [7]:
df['year'] = df['date'].dt.year
df.head()

        date  year
0 2019-12-16  2019
1 2019-12-16  2019
2 2019-12-16  2019
3 2019-12-16  2019
4 2019-12-16  2019

# 2.month

In [8]:
df['month'] = df['date'].dt.month
df.sample(5)

             date  year  month
78694  2019-12-11  2019     12
243    2019-12-16  2019     12
123854 2018-08-29  2018      8
359164 2019-07-12  2019      7
143527 2018-08-19  2018      8

In [9]:
df['month_name'] = df['date'].dt.month_name()
df.sample(5)

             date  year  month month_name
233394 2019-02-10  2019      2   February
150028 2018-08-23  2018      8     August
406580 2018-12-23  2018     12   December
51311  2019-05-30  2019      5        May
321797 2019-08-14  2019      8     August

# 3.days

In [10]:
df['day'] = df['date'].dt.day
df.sample(3)

             date  year  month month_name  day
158574 2018-07-18  2018      7       July   18
304915 2019-07-08  2019      7       July    8
387283 2019-07-08  2019      7       July    8

In [11]:
df['day_of_week'] = df['date'].dt.dayofweek
df.sample(4)

             date  year  month month_name  day  day_of_week
392414 2019-06-09  2019      6       June    9            6
38919  2019-10-14  2019     10    October   14            0
115836 2018-08-31  2018      8     August   31            4
135613 2018-09-15  2018      9  September   15            5

In [12]:
df['day_name'] = df['date'].dt.day_name()
df.sample(4)

             date  year  month month_name  day  day_of_week  day_name
134975 2018-09-08  2018      9  September    8            5  Saturday
331809 2019-06-09  2019      6       June    9            6    Sunday
90943  2019-12-02  2019     12   December    2            0    Monday
244529 2019-04-22  2019      4      April   22            0    Monday

In [13]:
# weekend ?
df['weekend'] = np.where(df['date'].isin(['Sunday','Saturday']),1,0)
df.sample(4)

             date  year  month month_name  day  day_of_week  day_name  weekend
156246 2018-08-13  2018      8     August   13            0    Monday        0
414132 2019-01-10  2019      1    January   10            3  Thursday        0
516074 2018-12-09  2018     12   December    9            6    Sunday        0
57862  2019-05-17  2019      5        May   17            4    Friday        0

# Extract week of the year

In [14]:
df['date_week']  = df['date'].dt.week
df.sample(4)

C:\Users\user\AppData\Local\Temp\ipykernel_11124\288318129.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  df['date_week']  = df['date'].dt.week

,date,year,month,month_name,day,day_of_week,day_name,weekend,date_week
137727,2018-08-10,2018,8,August,10,4,Friday,0,32
120065,2018-08-14,2018,8,August,14,1,Tuesday,0,33
186584,2019-03-09,2019,3,March,9,5,Saturday,0,10
375727,2019-07-02,2019,7,July,2,1,Tuesday,0,27

# Extract Quarter

In [15]:
df['quarter'] = df['date'].dt.quarter
df.sample(4)

,date,year,month,month_name,day,day_of_week,day_name,weekend,date_week,quarter
64211,2019-05-04,2019,5,May,4,5,Saturday,0,18,2
510364,2018-10-12,2018,10,October,12,4,Friday,0,41,4
63854,2019-05-03,2019,5,May,3,4,Friday,0,18,2
361158,2019-06-21,2019,6,June,21,4,Friday,0,25,2

# Extract semester

In [16]:
df['semester'] = np.where(df['quarter'].isin([1,2]),1,2)
df.sample(4)

,date,year,month,month_name,day,day_of_week,day_name,weekend,date_week,quarter,semester
339559,2019-07-20,2019,7,July,20,5,Saturday,0,29,3,2
44169,2019-05-30,2019,5,May,30,3,Thursday,0,22,2,1
384755,2019-07-30,2019,7,July,30,1,Tuesday,0,31,3,2
31373,2019-10-13,2019,10,October,13,6,Sunday,0,41,4,2

# Extract Time elapsed between dates

In [17]:
import datetime
today= datetime.datetime.today()
today

datetime.datetime(2023, 10, 6, 17, 12, 34, 632840)

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  10000 non-null  object
dtypes: object(1)
memory usage: 78.2+ KB

In [23]:
df1['Timestamp'] = pd.to_datetime(df1['Timestamp'])

In [24]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  10000 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 78.2 KB

In [25]:
(today - df1['Timestamp'])

0      2674 days 19:29:29.632840
1      2819 days 23:16:29.632840
2      2655 days 06:21:49.632840
3      2663 days 02:40:02.632840
4      2633 days 06:17:59.632840
                  ...
9995   2833 days 13:50:19.632840
9996   2687 days 04:52:19.632840
9997   2831 days 05:19:17.632840
9998   2741 days 10:04:48.632840
9999   2741 days 19:58:48.632840
Name: Timestamp, Length: 10000, dtype: timedelta64[ns]

In [32]:
(today - df1['Timestamp']).dt.days

0       2674
1       2819
2       2655
3       2663
4       2633
        ...
9995    2833
9996    2687
9997    2831
9998    2741
9999    2741
Name: Timestamp, Length: 10000, dtype: int64

In [34]:
# months passed
np.round((today -df1['Timestamp'])/ np.timedelta64(1,'M'),0)

0       88.0
1       93.0
2       87.0
3       87.0
4       87.0
        ...
9995    93.0
9996    88.0
9997    93.0
9998    90.0
9999    90.0
Name: Timestamp, Length: 10000, dtype: float64

In [37]:
df1['hour'] = df1['Timestamp'].dt.hour
df1['min'] = df1['Timestamp'].dt.minute
df1['sec'] = df1['Timestamp'].dt.second

df1.sample(4)

               Timestamp  hour  min  sec
2241 2016-02-08 14:02:22    14    2   22
7687 2016-01-05 11:53:17    11   53   17
98   2016-01-16 23:37:51    23   37   51
796  2016-02-06 17:48:28    17   48   28

# Extract Time part

In [39]:
df1['time'] = df1['Timestamp'].dt.time
df1.head()

            Timestamp  hour  min  sec      time
0 2016-06-09 21:43:05    21   43    5  21:43:05
1 2016-01-16 17:56:05    17   56    5  17:56:05
2 2016-06-29 10:50:45    10   50   45  10:50:45
3 2016-06-21 14:32:32    14   32   32  14:32:32
4 2016-07-21 10:54:35    10   54   35  10:54:35

# Time difference

In [41]:
today -df1['Timestamp']

0      2674 days 19:29:29.632840
1      2819 days 23:16:29.632840
2      2655 days 06:21:49.632840
3      2663 days 02:40:02.632840
4      2633 days 06:17:59.632840
                  ...
9995   2833 days 13:50:19.632840
9996   2687 days 04:52:19.632840
9997   2831 days 05:19:17.632840
9998   2741 days 10:04:48.632840
9999   2741 days 19:58:48.632840
Name: Timestamp, Length: 10000, dtype: timedelta64[ns]

In [43]:
# in seconds

(today- df1["Timestamp"])/np.timedelta64(1,'s')

0       2.311038e+08
1       2.436454e+08
2       2.294149e+08
3       2.300928e+08
4       2.275139e+08
            ...
9995    2.448210e+08
9996    2.321743e+08
9997    2.446176e+08
9998    2.368587e+08
9999    2.368943e+08
Name: Timestamp, Length: 10000, dtype: float64

In [44]:
# in minutes

(today - df1['Timestamp'])/np.timedelta64(1,'m')

0       3.851729e+06
1       4.060756e+06
2       3.823582e+06
3       3.834880e+06
4       3.791898e+06
            ...
9995    4.080350e+06
9996    3.869572e+06
9997    4.076959e+06
9998    3.947645e+06
9999    3.948239e+06
Name: Timestamp, Length: 10000, dtype: float64

In [46]:
# in hours

(today - df1['Timestamp'])/np.timedelta64(1,'h')

0       64195.491565
1       67679.274898
2       63726.363787
3       63914.667398
4       63198.299898
            ...
9995    68005.838787
9996    64492.872120
9997    67949.321565
9998    65794.080176
9999    65803.980176
Name: Timestamp, Length: 10000, dtype: float64